# На вход программе подается одно число n.
# Напишите программу, которая выводит список [1, 2, 3, ..., n].

num = int(input())
numbers = list(range(1, num + 1))
print(numbers)